---
kind: type
id: T:Autodesk.Revit.DB.PreviewFamilyVisibilityMode
source: html/efc5a721-5885-f63e-64af-83e0c93e6c45.htm
---
# Autodesk.Revit.DB.PreviewFamilyVisibilityMode

Modes that control visibility of family elements depending on
 the currently applied Element Visibility Settings of a view.

## Syntax (C#)
```csharp
public enum PreviewFamilyVisibilityMode
```

## Remarks
Values of this mode can be set or obtained for any view that supports it by accessing
 the [!:Autodesk::Revit::DB::TemporaryViewModes::PreviewFamilyVisibility]
 property.